In [1]:
import pandas as pd

In [2]:
full_df = pd.read_csv('./lcmap_full_27k_plot_ids.csv')

In [3]:
df = full_df.head(25000)

In [4]:
df.shape

(25000, 5)

In [5]:
smaller_df = df.iloc[::5]

In [6]:
smaller_df.shape

(5000, 5)

In [7]:
smaller_df.head()

    plot_id  original_plot_id        x        y  project_id
0         1                 1 -1853280  1557720        3130
5         6                 6   413160   729360        3130
10       11                11   172350  1749900        3130
15       16                16  1382460  1265190        3130
20       21                21 -1325100  1043760        3130

In [8]:
smaller_df.tail()

       plot_id  original_plot_id        x        y  project_id
24975    24976             24976  1369440  2049600        3130
24980    24981             24981   974190  1610370        3130
24985    24986             24986  -889320  2579040        3130
24990    24991             24991  1668180  1651710        3130
24995    24996             24996  -982140  2025420        3130

In [9]:
smaller_df = smaller_df.drop(columns=['original_plot_id'])

In [10]:
smaller_df['Strata'] = 99

In [11]:
smaller_df.tail()

       plot_id        x        y  project_id  Strata
24975    24976  1369440  2049600        3130      99
24980    24981   974190  1610370        3130      99
24985    24986  -889320  2579040        3130      99
24990    24991  1668180  1651710        3130      99
24995    24996  -982140  2025420        3130      99

In [12]:
smaller_df = smaller_df.reset_index(drop=True)

In [15]:
smaller_df.to_csv('b4_danika_5000.csv', index=False)